tangyangguang/Esp32Base/src/web/internal/WebAssets.cpp
#if ESP32BASE_ENABLE_APP_CONFIG
// Page-scoped CSS for /esp32base/app-config. Kept out of WEB_HEAD so Status, Logs, WiFi,
// Auth, OTA and Tools pages don't pay ~700 B per request for App Config-only styles.
const char WEB_APPCFG_STYLE[] PROGMEM =
    "<style>"
    ".appcfg{margin:0}.appcfg .pagehead,.appcfg .panel{margin:12px 0}.appcfg .panel{padding:12px}.appcfg .acfield{max-width:760px;margin:0 0 11px}.appcfg .acfield:last-child{margin-bottom:0}.appcfg .acfield>label{margin:0 0 3px}.appcfg input:not([type]),.appcfg input[type=text],.appcfg input[type=number],.appcfg select{font-size:14px;padding:6px 8px;margin:0;border:1px solid #ccd5dd;border-radius:7px;box-sizing:border-box;background:#fff;color:#1f2933}.appcfg input:not([type]),.appcfg input[type=text],.appcfg input[type=number]{width:100%}.appcfg select{max-width:260px;width:auto}.appcfg .acrow{display:flex;gap:7px;align-items:center;max-width:760px}.appcfg .acrow input{flex:1 1 auto;min-width:0}.appcfg .acrow input[type=number]{flex:0 1 14ch;width:14ch}.appcfg .unit{color:var(--eb-muted);font-size:13px;flex:0 0 auto}.appcfg .help{color:var(--eb-muted);font-size:13px;margin:4px 0 0}.appcfg .restart{margin-left:4px;font-size:11px;vertical-align:1px}.appcfg .confirmbox{max-height:0;opacity:0;pointer-events:none;transform:translateY(-3px);border:1px solid transparent;background:#fbfcfd;border-radius:8px;padding:0 12px;margin:0;overflow:hidden;transition:opacity .14s ease,transform .18s ease}.appcfg .confirmbox.open{position:fixed;z-index:60;left:50%;top:50%;display:flex;flex-direction:column;width:min(760px,calc(100vw - 28px));max-height:calc(100dvh - 32px);opacity:1;pointer-events:auto;transform:translate(-50%,-50%);border-color:#cbd5df;padding:12px;overflow:hidden;box-shadow:0 18px 46px rgba(16,24,40,.18)}.appcfg .confirmbox h2{margin-bottom:3px}.appcfg .confirmbox .reviewhint{color:var(--eb-muted);font-size:13px;margin:0 0 9px}.appcfg .confirmbox.open .tablewrap{flex:1 1 auto;min-height:0;overflow:auto;border:1px solid var(--eb-line-soft);border-radius:7px;background:#fff}.appcfg .confirmbox table,.appcfg .pendingbox table{border-collapse:collapse;width:100%;font-size:13px}.appcfg .confirmbox th,.appcfg .confirmbox td,.appcfg .pendingbox th,.appcfg .pendingbox td{border-bottom:1px solid var(--eb-line);padding:6px 7px;text-align:left;vertical-align:top}.appcfg .confirmbox th{color:var(--eb-muted);font-weight:650}.appcfg .confirmbox th:nth-child(1){width:34%}.appcfg .confirmbox th:nth-child(2),.appcfg .confirmbox th:nth-child(3){width:33%}.appcfg .confirmbox td:nth-child(3){font-weight:650;color:#25313f}.appcfg .confirmbox tr:last-child td,.appcfg .pendingbox tr:last-child td{border-bottom:0}.appcfg .acgroup th{background:#f3f6f8;color:#526071;font-size:12px;font-weight:700}.appcfg .confirmbox .actions{justify-content:center;padding-top:10px;margin-top:0}.appcfg .confirmbox .cancelbtn{background:#f3f5f5;color:#344054;border:1px solid var(--eb-line)}.appcfg .confirmbox .cancelbtn:hover{background:#e9eef2}.appcfg .acsavebar{min-height:30px;transition:opacity .12s ease}.appcfg .acsavebar.reviewing{visibility:hidden;opacity:0;pointer-events:none}.appcfg .pendingbox{border-color:#efcf96;background:var(--eb-warn-soft);overflow-x:auto}.appcfg #acsavebar,.appcfg .confirmbox .actions{max-width:760px}@media(max-width:640px){.appcfg select{width:100%;max-width:none}.appcfg .acrow{align-items:flex-start}.appcfg .acrow input[type=number]{max-width:100%}.appcfg .unit{padding-top:7px}.appcfg .confirmbox.open{width:calc(100vw - 20px);max-height:calc(100dvh - 20px);padding:11px}.appcfg .confirmbox th,.appcfg .confirmbox td{padding:6px 5px}}"
    "</style>";
#endif

void handleUiCss() {
    markRequest();
    g_server.sendHeader("Cache-Control", "public, max-age=86400");
    g_server.sendHeader("X-Content-Type-Options", "nosniff");
    g_server.send_P(200, WEB_CSS_TYPE, WEB_CSS);
}

} // namespace esp32base_web

#endif
